import json

from processor.query_process.base import BaseNode
from processor.query_process.state import QueryGraphState


class RRFMergeNode(BaseNode):
    name = "rrf_merge_node"

    def process(self, state: QueryGraphState) -> QueryGraphState:
        #从state中获取两路结果
        embedding_chunks = state.get("embedding_chunks",[])
        hyde_embedding_chunks = state.get("hyde_embedding_chunks",[])

        #标准化两路结果数据结构
        validated_embedding_chunks = self._validate_search_chunks(embedding_chunks)
        validated_hyde_embedding_chunks = self._validate_search_chunks(hyde_embedding_chunks)

        #设置两路权重
        rrf_inputs = [
            (validated_embedding_chunks,1.0),
            (validated_hyde_embedding_chunks,1.0)
        ]

        #rrf融合
        rrf_chunks = self._rrf_merge(rrf_inputs)

        #取出Top_k
        rrf_chunks = rrf_chunks[:self.config.rrf_max_results]
        #设置state
        state["rrf_chunks"] = rrf_chunks
        return state
        pass


    def _validate_search_chunks(self, embedding_chunks):
        formatted_chunk_list = []
        if not embedding_chunks or not isinstance(embedding_chunks, list):
            return []

        for chunk in embedding_chunks:
            if chunk and isinstance(chunk, dict):
                id = chunk.get("id")
                entity = chunk.get("entity")
                formatted_chunk = {
                    "chunk_id":id,
                    "file_title":entity.get("file_title"),
                    "title":entity.get("title"),
                    "item_name":entity.get("item_name"),
                    "content":entity.get("content"),
                }
                formatted_chunk_list.append(formatted_chunk)
            else:
                return []
        #返回
        return formatted_chunk_list


    def _rrf_merge(self, rrf_inputs):
        #rrf算法：weight/（k+rank） rank排名 k = 60
        #{"chunk_id":"score"}
        chunks_score = {}
        chunk_data = {}
        for chunks_list,weight in rrf_inputs:
            for index,chunk in enumerate(chunks_list):
                chunks_id = chunk.get("chunk_id")
                rank = index + 1
                rrf_score = weight/(self.config.rrf_k+rank)

                chunks_score[chunks_id] = chunks_score.get(chunks_id,0.0) + rrf_score
                #setdefault读写 如果id有值不加入chunk
                chunk_data.setdefault(chunks_id,chunk)

        #结果处理
        rrf_results = []
        for chunks_id, score in chunks_score.items():
            chunk = chunk_data.get(chunks_id)
            #内容and得分
            rrf_results.append((chunk,score))
        #按分数排序
        rrf_results = sorted(rrf_results, key=lambda x: x[1],reverse=True)
        rrf_chunks = [chunk for chunk,score in rrf_results]
        return rrf_chunks[:self.config.rrf_max_results]


if __name__ == "__main__":
    rrf_node = RRFMergeNode()
    state = {
    "session_id": "",
    "task_id": "",
    "message_id": "",
    "original_query": "RS-12数字万用表如何测量电阻",
    "embedding_chunks": [
        {
            "id": 468568991990268392,
            "distance": 0.7378970384597778,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n## 电阻测量\n\n\n警告: 为防触电,测量前应断开电源，把所有电容放电，取出电池和拔掉电线。\n\n1. 将功能转盘置于最高电阻Ω位置.\n\n2. 将黑色表笔插入负极COM端口，红色表笔插入正极Ω端口\n\n3. 把表笔接触被测电路或元件。测试时最好断开电路的一端，以使剩余的电路不会干扰被测电阻数值。\n\n4. 读取显示屏上读数，然后将功能转盘调至最低电阻Ω档位，通常大于实际电阻或预测电阻.读数由精确的小数点和数值表示。\n\n![使用万用表测量电阻](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/dfbcdd205c8748df2005169dfc3c1b55f16dfe3a15024197c9d1a6b0064a9d6e.jpg)\n\n\n## 短路蜂鸣测试\n\n\n警告：请不要在接通电源的情况下进行在线短路蜂鸣测试以免触电。\n\n1. 将功能键转盘置于 位置。\n\n2. 将黑色表笔插入负极COM端口，红色表笔插入正极Ω端口。\n\n3. 把表笔与被测物体相接触。\n\n4. 当电阻小于30时Ω，仪表会发出蜂鸣.如果是开路，显示屏将显示“1”字符。\n",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        },
        {
            "id": 468568991990268388,
            "distance": 0.7299619913101196,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n万用表RS-12的使用\n\n## 规格\n\n- 【电阻】(对应功能)：量程为2000kΩ，分辨率为1kΩ，精确度为± (1.0% reading + 2 digits)。\n- 【电池】(对应功能)：量程为9V，分辨率为10mV，精确度为± (1.0% reading + 2 digits)。\n- 【电池】(对应功能)：量程为1.5V，分辨率为1mV，精确度为± (1.0% reading + 2 digits)。\n\n## 规格\n\n注意: 精确度规格由两种因素组成。\n● (% reading) –测量电路的精确度。\n● (+ digits) –数位转换器条码的精确度。\n注意: 精确度在65°F 至 83°F (18°C 至 28°C)，湿度低于75%RH时得出。\n\n## 技术指标说明\n\n\n二极管测试 测试电流最大值1mA, 开路电压 2.8V DC典型值\n\n短路蜂鸣测试 若电阻小于30时产生蜂鸣\n\n电池测试电流 9V (6mA)；1.5V (100mA)\n\n输入阻抗 >1MΩ\n\n交流电压频宽 45Hz～450Hz\n\nDCA电压跌路测试 200mV\n\n显示 3 ½ 数位，2000位液晶显示，1.1”数位\n\n超量程提示 以“1”表示\n\n极性 自动(正极无显示);负极显示(-)\n\n测量率 正常情况下每秒2次\n\n低电池提示 电池电压不足时，显示BAT符号\n\n电池 一粒9V (NEDA 1604) 电池\n\n保险丝 mA, µA 量程;0.2A/250V 快速熔断保险丝，A 档量程10A/250V快速熔断保险丝\n\n操作环境 32°F～122°F (0°C～50°C)\n\n储存温度 -4°F～140°F (-20°C～60°C)\n\n相对湿度 <70% 操作, <80% 储存\n\n室内使用,最高海拔 7000英尺(2000米)\n\n重量 255g\n\n尺寸 150mm x 70mm x 48mm\n\n安全认证 室内使用，符合过电压类别II\n\n污染级别 2\n",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        },
        {
            "id": 468568991990268387,
            "distance": 0.7166911363601685,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n万用表RS-12的使用\n\n## 控制与端口\n\n\n1.LCD液晶显示\n\n2.功能选择转盘\n\n3.10A端口\n\n4.COM端口\n\n5.正极端口\n\n6.数据保持按键\n\n7.背光按键\n\n![数字万用表功能与接口示意图](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/d6946861c4592804bd8d7e75b58029565712d4dc58f855e374bf0fcf370c91dd.jpg)\n\n\n## 功能符号指示\n\n\n•))) 蜂鸣指示\n\n![二极管符号](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/e92ffd955b1ca1fd14290da681a763771c958cbcf0a73a332107f471f96c29b2.jpg)\n\n二极管测试指示\n\nµ micro (电流范围)\n\nm milli ( 电压/电流范围)\n\nk kilo (电阻范围)\n\nVDC 直流电压\n\nVAC 交流电流\n\nADC 直流电流\n\nBAT 电池电量不足指示\n\n\n## 规格\n\n- 【直流电压】(对应功能)：量程为200mV，分辨率为0.1mV，精确度为± (0.5% reading + 2 digits)。\n- 【直流电压】(对应功能)：量程为2000mV，分辨率为1mV，精确度为± (0.5% reading + 2 digits)。\n- 【直流电压】(对应功能)：量程为20V，分辨率为0.01V，精确度为± (0.5% reading + 2 digits)。\n- 【直流电压】(对应功能)：量程为200V，分辨率为0.1V，精确度为± (0.8% reading + 2 digits)。\n- 【直流电压】(对应功能)：量程为600V，分辨率为1V，精确度为± (0.8% reading + 2 digits)。\n- 【交流电压】(对应功能)：量程为200V，分辨率为0.1V，精确度为± (1.2% reading + 10 digits50/60Hz)。\n- 【交流电压】(对应功能)：量程为600V，分辨率为1V，精确度为± (1.2% reading + 10 digits50/60Hz)。\n- 【直流电流】(对应功能)：量程为2000μA，分辨率为1μA，精确度为± (1.0% reading + 2 digits)。\n- 【直流电流】(对应功能)：量程为20mA，分辨率为10μA，精确度为± (1.0% reading + 2 digits)。\n- 【直流电流】(对应功能)：量程为200mA，分辨率为100μA，精确度为± (1.2% reading + 2 digits)。\n- 【直流电流】(对应功能)：量程为10A，分辨率为10mA，精确度为± (2.0% reading + 2 digits)。\n- 【电阻】(对应功能)：量程为200Ω，分辨率为0.1Ω，精确度为± (0.8% reading + 2 digits)。\n- 【电阻】(对应功能)：量程为2000Ω，分辨率为1Ω，精确度为± (0.8% reading + 2 digits)。\n- 【电阻】(对应功能)：量程为20kΩ，分辨率为0.01kΩ，精确度为± (0.8% reading + 2 digits)。\n- 【电阻】(对应功能)：量程为200kΩ，分辨率为0.1kΩ，精确度为± (0.8% reading + 2 digits)。",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        },
        {
            "id": 468568991990268390,
            "distance": 0.4307364821434021,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n万用表RS-12的使用\n\n## 测量非接触交流电压\n\n\n警告: 为了防止电击，请在使用前，确保正确使用此非接触交流电压测电笔。\n\n1. 让其探头靠近或插入火线的输出插座孔时。\n\n2. 如果火线带有220V交流电输出，指示灯就会被点亮。\n\n注意: 如果是零线和火线缠绕在一起时，此时测试要将两线分开，来进行火线与零线的区分。\n\n注意: 此非接触交流电压测电笔设计为高度灵敏探测.当遇到静电或其它能带电体时，可能指示灯也会亮起或瞬间闪烁，这属于正常现象。\n\n\n## 直流电压测量\n\n\n注意：正打开或关闭电源时不要进行此项测量，瞬间的强大电压将损坏仪表。\n\n1. 将功能转盘置于V DC的位置。\n\n2. 将黑色表笔插入负极COM端口，红色表笔插入正极V端口。\n\n3. 将表笔尖端接触被测物,确保极性正确(红色连正极,黑色连负极)。\n\n4. 显示屏上读取电压值。显示屏显示了精确的小数点，数值。若极性颠倒，数值前将显示负号。\n\n\n## 交流电压测量\n\n\n警告：谨防触电。\n\n若表笔长度不够不能接触到某些240V用具插座的带电部位，则可能出现插座有电而读到的数值却为0的情况。因此若无电压显示，应检查表笔是否接触到了插座内的金属接口。\n\n注意：正打开或关闭电源时不要进行此项测量，瞬间的强大电压将损坏仪表。\n\n![使用万用表测量电压](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/84c37b209829d15820d5bbe76bbc98e1bf9eddc58bd9c983fc710cb2747d341b.jpg)\n\n1. 将功能转盘置于V AC的位置。\n\n2. 将黑色表笔插入负极COM端口，红色表笔插入正极V端口。\n\n3. 将表笔尖端接触被测物。\n\n4. 显示屏上读取电压值。显示屏显示了精确的小数点，数值和(AC,V等)符号。\n\n在显示屏上读取电压数据。不断重调功能转盘至低交流电压档位获得高分辨率读数。读数由精确的小数点和数值表示。\n",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        },
        {
            "id": 468568991990268393,
            "distance": 0.42575716972351074,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n万用表RS-12的使用\n\n## 二极管测试\n\n\n1. 将黑色表笔插入负极COM 端口，红色表笔插入正极V端口。\n\n2. 将功能转盘置于 位置。\n\n3. 把表笔与二极管相接触，正向电压将显示400 至 700mV.反向电压显示“ 1”符号.短路时将显示接近 0V，开路时会在两种极性上显示“1”符号。\n\n\n## 电池测试\n\n\n1. 将黑色表笔插入负极COM端口，红色表笔插入正极V 端口。\n\n2. 使用功能选择键，选择1.5V 或 9V 电池档位。\n\n3. 将红色表笔接触电池正极，将黑色表笔接触电池负极。\n\n4. 在显示屏上读取数值。\n\n\n\n- 【9V 电池：】：良好为>8.2V，较弱为7.2 至 8.2V，坏的为<7.2V。\n- 【1.5V 电池：】：良好为>1.35V，较弱为1.22 至 1.35V，坏的为<1.22V。\n\n\n\n\n## 更换电池\n\n\n警告：为防触电，打开电池后盖前后，请勿操作仪表并把表笔与电源断开。\n\n1. 当电池电压不足时，显示屏上会出现“BAT”符号，此时应更换电池。\n\n2. 按下面的步骤安装电池。\n\n3. 妥善处理废电池。\n\n警告: 为防触电,在电池后盖安装和固定之前，请勿操作仪表。\n",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        }
    ],
    "hyde_embedding_chunks": [
        {
            "id": 468568991990268392,
            "distance": 0.7900659441947937,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n## 电阻测量\n\n\n警告: 为防触电,测量前应断开电源，把所有电容放电，取出电池和拔掉电线。\n\n1. 将功能转盘置于最高电阻Ω位置.\n\n2. 将黑色表笔插入负极COM端口，红色表笔插入正极Ω端口\n\n3. 把表笔接触被测电路或元件。测试时最好断开电路的一端，以使剩余的电路不会干扰被测电阻数值。\n\n4. 读取显示屏上读数，然后将功能转盘调至最低电阻Ω档位，通常大于实际电阻或预测电阻.读数由精确的小数点和数值表示。\n\n![使用万用表测量电阻](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/dfbcdd205c8748df2005169dfc3c1b55f16dfe3a15024197c9d1a6b0064a9d6e.jpg)\n\n\n## 短路蜂鸣测试\n\n\n警告：请不要在接通电源的情况下进行在线短路蜂鸣测试以免触电。\n\n1. 将功能键转盘置于 位置。\n\n2. 将黑色表笔插入负极COM端口，红色表笔插入正极Ω端口。\n\n3. 把表笔与被测物体相接触。\n\n4. 当电阻小于30时Ω，仪表会发出蜂鸣.如果是开路，显示屏将显示“1”字符。\n",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        },
        {
            "id": 468568991990268386,
            "distance": 0.778587818145752,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n## 安全手册\n\n\n为了您的安全，请在使用本仪表之前仔细阅读该手册:\n\n使用本表时，请勿将输入的测量值超出其所允许的量程范围。\n\n\n\n- 【功能】：输入量程为最大输入。\n- 【交/直流电压】：输入量程为直流/交流电压600V。\n- 【直流/交流电压】：输入量程为直流/交流电压600V, 200Vrms 用于200mV量程。\n- 【mA直流】：输入量程为200mA 250V快速熔断保险丝。\n- 【A DC】：输入量程为10A 250V 快速熔断保险丝(最多每15分钟，需时30秒)。\n- 【电阻,短路测试】：输入量程为250Vrms, 最多15秒。\n\n\n\n2. 在测量高压电路时，请严格注意个人及设备的安全防护措施。\n\n3. 若负极端口（COM）电压超出500V以上接地电压，请勿进行电压测试。\n\n4. 若功能开关置于电流，电阻或二极管位置时，请勿将表笔与电路相连接，否则会损坏仪表。\n\n5. 进行电阻或二极管测试时，应把电容放电并断开电源。\n\n6. 打开后盖，更换保险丝或电池之前，请关闭电源并取下表笔。\n\n7. 请勿使用仪表，直到电池盖和保险丝盖装好，螺丝拧紧。\n\n\n## 安全标识\n\n\n![警告标志](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/6ed1c2d2c192fe7422f77d0eb13133a4f4b01ea3e738ce2017bc5df75185e1a0.jpg)\n\n表明此操作须参照说明书进行。\n\nWARNING 表明此处可能出现危险电压，请避开以免导致死亡或严重伤害。\n\nCAUTION 表明此处可能出现危险电压，请避开以免导致仪表的损坏。\n\n![最大液位标记](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/4033d9da04e1ffceb8382efdf1c281a8fbddf7ebe238b3aa131ff2f0c43fbeb0.jpg)\n\n请勿连接到500VAC或VDC的电路上。\n\n![闪电符号](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/2219ca75130874ec766983013be86c7afd233a4a1b3a5188990261156f1f2cc5.jpg)\n\n表明此端口可能出现危险电压。\n\n![双层方框图案](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/6b7cc68242e90cec872c128c48320467c4ea101b9973420a5a2a2c46c1a7d489.jpg)\n\n双绝缘保护。\n",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        },
        {
            "id": 468568991990268390,
            "distance": 0.7709403038024902,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n万用表RS-12的使用\n\n## 测量非接触交流电压\n\n\n警告: 为了防止电击，请在使用前，确保正确使用此非接触交流电压测电笔。\n\n1. 让其探头靠近或插入火线的输出插座孔时。\n\n2. 如果火线带有220V交流电输出，指示灯就会被点亮。\n\n注意: 如果是零线和火线缠绕在一起时，此时测试要将两线分开，来进行火线与零线的区分。\n\n注意: 此非接触交流电压测电笔设计为高度灵敏探测.当遇到静电或其它能带电体时，可能指示灯也会亮起或瞬间闪烁，这属于正常现象。\n\n\n## 直流电压测量\n\n\n注意：正打开或关闭电源时不要进行此项测量，瞬间的强大电压将损坏仪表。\n\n1. 将功能转盘置于V DC的位置。\n\n2. 将黑色表笔插入负极COM端口，红色表笔插入正极V端口。\n\n3. 将表笔尖端接触被测物,确保极性正确(红色连正极,黑色连负极)。\n\n4. 显示屏上读取电压值。显示屏显示了精确的小数点，数值。若极性颠倒，数值前将显示负号。\n\n\n## 交流电压测量\n\n\n警告：谨防触电。\n\n若表笔长度不够不能接触到某些240V用具插座的带电部位，则可能出现插座有电而读到的数值却为0的情况。因此若无电压显示，应检查表笔是否接触到了插座内的金属接口。\n\n注意：正打开或关闭电源时不要进行此项测量，瞬间的强大电压将损坏仪表。\n\n![使用万用表测量电压](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/84c37b209829d15820d5bbe76bbc98e1bf9eddc58bd9c983fc710cb2747d341b.jpg)\n\n1. 将功能转盘置于V AC的位置。\n\n2. 将黑色表笔插入负极COM端口，红色表笔插入正极V端口。\n\n3. 将表笔尖端接触被测物。\n\n4. 显示屏上读取电压值。显示屏显示了精确的小数点，数值和(AC,V等)符号。\n\n在显示屏上读取电压数据。不断重调功能转盘至低交流电压档位获得高分辨率读数。读数由精确的小数点和数值表示。\n",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        },
        {
            "id": 468568991990268393,
            "distance": 0.4499228000640869,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n万用表RS-12的使用\n\n## 二极管测试\n\n\n1. 将黑色表笔插入负极COM 端口，红色表笔插入正极V端口。\n\n2. 将功能转盘置于 位置。\n\n3. 把表笔与二极管相接触，正向电压将显示400 至 700mV.反向电压显示“ 1”符号.短路时将显示接近 0V，开路时会在两种极性上显示“1”符号。\n\n\n## 电池测试\n\n\n1. 将黑色表笔插入负极COM端口，红色表笔插入正极V 端口。\n\n2. 使用功能选择键，选择1.5V 或 9V 电池档位。\n\n3. 将红色表笔接触电池正极，将黑色表笔接触电池负极。\n\n4. 在显示屏上读取数值。\n\n\n\n- 【9V 电池：】：良好为>8.2V，较弱为7.2 至 8.2V，坏的为<7.2V。\n- 【1.5V 电池：】：良好为>1.35V，较弱为1.22 至 1.35V，坏的为<1.22V。\n\n\n\n\n## 更换电池\n\n\n警告：为防触电，打开电池后盖前后，请勿操作仪表并把表笔与电源断开。\n\n1. 当电池电压不足时，显示屏上会出现“BAT”符号，此时应更换电池。\n\n2. 按下面的步骤安装电池。\n\n3. 妥善处理废电池。\n\n警告: 为防触电,在电池后盖安装和固定之前，请勿操作仪表。\n",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        },
        {
            "id": 468568991990268387,
            "distance": 0.44870302081108093,
            "entity": {
                "file_title": "万用表RS-12的使用",
                "title": "万用表RS-12的使用",
                "content": "万用表RS-12的使用\n\n万用表RS-12的使用\n\n## 控制与端口\n\n\n1.LCD液晶显示\n\n2.功能选择转盘\n\n3.10A端口\n\n4.COM端口\n\n5.正极端口\n\n6.数据保持按键\n\n7.背光按键\n\n![数字万用表功能与接口示意图](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/d6946861c4592804bd8d7e75b58029565712d4dc58f855e374bf0fcf370c91dd.jpg)\n\n\n## 功能符号指示\n\n\n•))) 蜂鸣指示\n\n![二极管符号](http://192.168.10.100:9000/knowledge-base/万用表RS-12的使用/e92ffd955b1ca1fd14290da681a763771c958cbcf0a73a332107f471f96c29b2.jpg)\n\n二极管测试指示\n\nµ micro (电流范围)\n\nm milli ( 电压/电流范围)\n\nk kilo (电阻范围)\n\nVDC 直流电压\n\nVAC 交流电流\n\nADC 直流电流\n\nBAT 电池电量不足指示\n\n\n## 规格\n\n- 【直流电压】(对应功能)：量程为200mV，分辨率为0.1mV，精确度为± (0.5% reading + 2 digits)。\n- 【直流电压】(对应功能)：量程为2000mV，分辨率为1mV，精确度为± (0.5% reading + 2 digits)。\n- 【直流电压】(对应功能)：量程为20V，分辨率为0.01V，精确度为± (0.5% reading + 2 digits)。\n- 【直流电压】(对应功能)：量程为200V，分辨率为0.1V，精确度为± (0.8% reading + 2 digits)。\n- 【直流电压】(对应功能)：量程为600V，分辨率为1V，精确度为± (0.8% reading + 2 digits)。\n- 【交流电压】(对应功能)：量程为200V，分辨率为0.1V，精确度为± (1.2% reading + 10 digits50/60Hz)。\n- 【交流电压】(对应功能)：量程为600V，分辨率为1V，精确度为± (1.2% reading + 10 digits50/60Hz)。\n- 【直流电流】(对应功能)：量程为2000μA，分辨率为1μA，精确度为± (1.0% reading + 2 digits)。\n- 【直流电流】(对应功能)：量程为20mA，分辨率为10μA，精确度为± (1.0% reading + 2 digits)。\n- 【直流电流】(对应功能)：量程为200mA，分辨率为100μA，精确度为± (1.2% reading + 2 digits)。\n- 【直流电流】(对应功能)：量程为10A，分辨率为10mA，精确度为± (2.0% reading + 2 digits)。\n- 【电阻】(对应功能)：量程为200Ω，分辨率为0.1Ω，精确度为± (0.8% reading + 2 digits)。\n- 【电阻】(对应功能)：量程为2000Ω，分辨率为1Ω，精确度为± (0.8% reading + 2 digits)。\n- 【电阻】(对应功能)：量程为20kΩ，分辨率为0.01kΩ，精确度为± (0.8% reading + 2 digits)。\n- 【电阻】(对应功能)：量程为200kΩ，分辨率为0.1kΩ，精确度为± (0.8% reading + 2 digits)。",
                "item_name": "RS PRO RS-12 数字万用表"
            }
        }
    ],
    "rrf_chunks": [],
    "web_search_docs": [
        {
            "title": "万用表测电阻数字表示什么?例如显示数字为0,是表示没有电阻?还是电阻无限大,不通电?",
            "url": "https://www.zhihu.com/question/580960365/answer/3001352962",
            "snippet": "万用表测电阻数字表示什么?例如显示数字为0,是表示没有电阻?还是电阻无限大,不通电? 万用表测电阻数字表示什么?例如显示数字为0,是表示没有电阻?还是电阻无限大,不通电? 万用表测电阻数字表示什么? 例如显示数字为0,是表示没有电阻?还是电阻无限大,不通电? 如果显示为20,是否说电阻为20?还是表示通电值为20? 知乎用户 【溪城说电路,好用不迷糊。】 各位看官好,今天不说电路图,咱好好唠唠,数字万用表如何测电阻? 说到数字万用表,相信大家都不陌生。 有人会问,测电阻这么简单,还要讨论吗? 别急,看完这篇文章,相信你会有新收获。 准备工作: 步骤1:检查万用表 开机,检查无电池亏电报警。 将红表笔插入V/Ω插孔,黑表笔插入COM插孔,选择任意“欧姆档”。 短接试验:将两支表笔金属探针相碰短接,此时,屏幕应该显示:“0” Ω,或者“000” 开路试验:将两支表笔金属探分开,此时,屏幕应该显示:“1” ,或者 “0L” 做完这2项测试,效果如上述描述一样,说明万用表是好的。 步骤2:预估电阻阻值,选择适宜量程。 根据电阻标记的阻值,选择适宜的欧姆档量程。 被测电阻值,小于 200Ω时,用200Ω挡测量; 被测电阻值,在 200Ω — 2KΩ之间,用2kΩ挡测量; 被测电阻值,在 2kΩ — 2MΩ之间, 用2MΩ挡测量; 被测电阻值,大于2MΩ时,用20MΩ挡测量。 如果,选择的量程小于电阻值,则测量时,会显示“1” ,或者 “0L”,需要更换大一档的测量档位。 步骤3:测电阻。 断电测电阻,这是前提,否则测不准,还有可能伤表。 把两支表笔,并联在被测量电阻的两引脚上,此时测得的电阻值,应与该电阻的标称阻值相符合。 测量电阻时,手不能同时触及被测电阻的两端,以免人体电阻的并联作用,影响测量结果,尤其测量高阻值时,要注意这一点。 因为电阻有误差等级,实测阻值与标称阻值之间允许有士5%、士10%和士20%的误差。 若超出误差范围,则说明被测电阻已经变值。 若测得的结果为0,则说明被测电阻已短路烧坏,需要更换 若测得的电阻值为“1” ,或者 “0L”,则说明该电阻已断路损坏,需要更换 步骤4:严谨的读数。 在做仪表检查,短接试验时,应记录读数。 假设短接试验,读数为:0.3Ω,实际测量为:5.0Ω, 则电阻的实际阻值为:5.0— 0.3 = 4.7Ω。 此读法,适用于,200Ω以下的小阻值电阻读数。 一般来说,表笔短接试验,读数都在0Ω左右。 测量只有几欧姆的电阻时,应当刮去电阻引脚的氧化层。"
        },
        {
            "title": "怎么用数字万用表测量电阻 ",
            "url": "https://easylearn.baidu.com/edu-page/tiangong/questiondetail?id=1728213610231814564&fr=search",
            "snippet": "怎么用数字万用表测量电阻 1. 插表笔:将黑表笔插入数字万用表的COM(公共)接口,红表笔插入V/Ω(电压/电阻)接口;2. 选量程:将功能选择旋钮拨至欧姆档(标注为“Ω”)的合适量程(如测量未知电阻时,可先选择较大量程,再根据测量结果调整至更精确的量程);3. 校零(自动量程万用表无需此步骤):若使用手动量程万用表,将两表笔金属端短接,调整调零旋钮(若有)使显示屏示数为0Ω;4. 测电阻:将待测电阻从电路中断开(避免电路干扰或带电损坏仪表),用两表笔分别接触电阻的两个引脚;5. 读结果:观察显示屏数值,结合所选量程的单位(如“kΩ”“MΩ”)读取电阻值(如“20kΩ”量程下显示“10.5”,表示电阻为10.5kΩ)。"
        },
        {
            "title": "简述数字万用表测量电阻方法和步骤。",
            "url": "https://easylearn.baidu.com/edu-page/tiangong/bgkdetail?id=8436047f168884868762d633&fr=search",
            "snippet": "简述数字万用表测量电阻方法和步骤。 将表笔插进“COM”和“VΩ”孔中,把旋钮打旋到“Ω”中所需的量程(注意:表盘上的数值均为最大量程),用表笔接在电阻两端金属部位,测量中可以用手接触电阻,但不要把手同时接触电阻两端,这样会影响测量精确度的(人体是电阻很大但是有限大的导体)。读数时,要保持表笔和电阻有良好的接触,数值可以直接从显示屏上读取,若显示为“1.”,则表明量程太小,那么就要加大量程后再测量工业电器。注意单位:在“200”档时单位是“Ω”,在“2K”到“200K“档时单位为“KΩ ”,“2M”以上的单位是“MΩ”。图1.11(b)为测量电阻方法示意图。"
        },
        {
            "title": "如何正确使用数字万用表测量电压、电阻?",
            "url": "https://easylearn.baidu.com/edu-page/tiangong/questiondetail?id=1828370570798890731&fr=search",
            "snippet": "如何正确使用数字万用表测量电压、电阻? 使用前准备:阅读万用表说明书,熟悉电源开关、量程开关、插孔作用;检查仪表及表笔是否损坏(如表笔裸露、液晶显示异常等);将电源开关置于“ON”位置。直流/交流电压测量:红表笔插入“V/Ω”插孔,黑表笔插入“COM”插孔;功能量程选择开关置于DCV(直流电压)或ACV(交流电压)合适量程(未知电压范围时先选高量程再逐步调低);测试笔并联在被测信号源两端,记录读数及红表笔极性。电阻测量:红表笔插入“V/Ω”插孔,黑表笔插入“COM”插孔;功能量程选择开关置于“Ω”量程;若电阻在电路中需先断开电源,将测试笔跨接在被测电阻两端;若显示“1”说明超出量程,应选择更高档位。测量后处理:关掉仪表电源(“OFF”),长时间不用时取出电池;拔出并收好测试表笔。"
        },
        {
            "title": "数字万用表的正确使用与操作",
            "url": "https://jingyan.baidu.com/article/f00622280a57d0fbd3f0c818.html",
            "snippet": "电阻的测量(1)测量步骤l首先红表笔插入VΩ孔 黑表笔插入COM孔l量程旋钮打到“Ω”量程档适当位置l分别用红黑表笔接到电阻两端金属部分l读出显示屏上显示的数据 (2)注意l量程的选择和转换。量程选小了显示屏上会显示 “1.” 此时应换用较之大的量程;反之,量程选大了的话,显示屏上会显示一个接近于 “0” 的数,此时应换用较之小的量程。l如何读数?显示屏上显示的数字再加上边档位选择的单位就是它的读数。要提醒的是在“200”档时单位是“Ω”,在“2k~200k” 档时单位是“kΩ”,在“2M~2000M”档时单“M”。l如果被测电阻值超出所选择量程的最大值,将显示过量程“1”,应选择更高的量程,对于大于1MΩ或更高的电阻,要几秒钟后读数才能稳定,这是正常的.l当没有连接好时,例如开路情况,仪表显示为“1”l当检查被测线路的阻抗时,要保证移开被测线路中的所有电源,所有电容放电.被测线路中,如有电源和储能元件,会影响线路阻抗测试正确性。l万用表的200MΩ档位,短路时有10个字,测量一个电阻时,应从测量读数中减去这10个字。如测一个电阻时,显示为101.0,应从101.0中减去10个字.被测元件的实际阻值为100.0即100MΩ。 直流电压的测量(1)测量步骤l红表笔插入VΩ孔l黑表笔插入COM孔l量程旋钮打到V-或V~适当位置 l读出显示屏上显示的数据(2)注意l把旋钮选到比估计值大的量程档(注意:直流档是V-,交流档是V~)接着把表笔接电源或电池两端;保持接触稳定。数值可以直接从显示屏上读取 l若显示为“1.”,则表明量程太小,那么就要加大量程后再测量。l若在数值左边出现“-”,则表明表笔极性与实际电源极性相反,此时红表笔接的是负极。 交流电压的测量(1)测量步骤l红表笔插入VΩ孔l黑表笔插入COM孔l量程旋钮打到V-或V~适当位置 l读出显示屏上显示的数据(2)注意l表笔插孔与直流电压的测量一样,不过应该将旋钮打到交流档“V～”处所需的量程即可。l交流电压无正负之分,测量方法跟前面相同。l无论测交流还是直流电压,都要注意人身安全,不要随便用手触摸表笔的金属部分。 直流电流的测量(1)测量步骤l断开电路l黑表笔插入com端口,红表笔插入mA或者20A端口l功能旋转开关打至A~(交流)或A-(直流),并选择 合适 的量程l断开被测线路,将数字万用表串联入被测 线路中,被测线路中电流从一端流入红表笔,经万用表黑表笔流出,再流入被测线路中l接通电路l读出LCD显示屏数字(2)注意l估计电路中电流的大小。"
        }
    ],
    "reranked_docs": [],
    "prompt": "",
    "answer": "",
    "item_names": [
        "RS PRO RS-12 数字万用表"
    ],
    "rewritten_query": "RS-12数字万用表如何测量电阻？",
    "history": [],
    "is_stream": False
}
    state = rrf_node.process(state)
    json_str = json.dumps(state, indent=4,ensure_ascii=False)
    print(json_str)









